In [1]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Diana'],
        'Age': [28, 34, 23, 29],
        'Department': ['HR', 'IT', 'Marketing', 'Finance'],
        'Salary': [45000, 60000, 35000, 50000]}

df = pd.DataFrame(data)
df

    Name  Age Department  Salary
0   John   28         HR   45000
1  Alice   34         IT   60000
2    Bob   23  Marketing   35000
3  Diana   29    Finance   50000

In [2]:
print(df.head(2))

df['Bonus'] = df['Salary'] * 0.10
print(df)

average_salary = df['Salary'].mean()
print(f"Average Salary: {average_salary}")

older_than_25 = df[df['Age'] > 25]
older_than_25

    Name  Age Department  Salary
0   John   28         HR   45000
1  Alice   34         IT   60000
    Name  Age Department  Salary   Bonus
0   John   28         HR   45000  4500.0
1  Alice   34         IT   60000  6000.0
2    Bob   23  Marketing   35000  3500.0
3  Diana   29    Finance   50000  5000.0
Average Salary: 47500.0

    Name  Age Department  Salary   Bonus
0   John   28         HR   45000  4500.0
1  Alice   34         IT   60000  6000.0
3  Diana   29    Finance   50000  5000.0